AxDen-Dev/NRF52_Solar_Power_Asset_Tracker_example/main.c
	// Build and set advertising data.
	memset(&advdata, 0, sizeof(advdata));

	advdata.name_type = BLE_ADVDATA_FULL_NAME;
	advdata.include_appearance = true;
	advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

	if (data_update_state) {

		ble_uuid_t adv_uuids[] = { { BLE_DATA_READY_UUID_SCAN_SERVICE,
				m_service.uuid_type } };

		memset(&srdata, 0, sizeof(srdata));
		srdata.uuids_complete.uuid_cnt = sizeof(adv_uuids)
				/ sizeof(adv_uuids[0]);
		srdata.uuids_complete.p_uuids = adv_uuids;

		interval = APP_DATA_READY_ADV_INTERVAL;

	} else {

		ble_uuid_t adv_uuids[] = { { BLE_IDLE_UUID_SCAN_SERVICE,
				m_service.uuid_type } };

		memset(&srdata, 0, sizeof(srdata));
		srdata.uuids_complete.uuid_cnt = sizeof(adv_uuids)
				/ sizeof(adv_uuids[0]);
		srdata.uuids_complete.p_uuids = adv_uuids;

		interval = APP_IDLE_ADV_INTERVAL;

	}

	err_code = ble_advdata_encode(&advdata, m_adv_data.adv_data.p_data,
			&m_adv_data.adv_data.len);
	APP_ERROR_CHECK(err_code);

	err_code = ble_advdata_encode(&srdata, m_adv_data.scan_rsp_data.p_data,
			&m_adv_data.scan_rsp_data.len);
	APP_ERROR_CHECK(err_code);

	ble_gap_adv_params_t adv_params;

	// Set advertising parameters.
	memset(&adv_params, 0, sizeof(adv_params));

	adv_params.primary_phy = BLE_GAP_PHY_1MBPS;
	adv_params.duration = APP_ADV_DURATION;
	adv_params.properties.type =
	BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
	adv_params.p_peer_addr = NULL;
	adv_params.filter_policy = BLE_GAP_ADV_FP_ANY;
	adv_params.interval = interval;

	err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data,
			&adv_params);
	APP_ERROR_CHECK(err_code);

}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error) {

	APP_ERROR_HANDLER(nrf_error);

}

static void ble_service_tx_complete_handler(uint16_t conn_handle,
		ble_service_t *p_service) {

	if (aggregator_notify_enable_state) {

		tx_complete_state = 0x02;

	} else if (stream_notify_enable_state) {

		tx_complete_state = 0x01;

	}

	NRF_LOG_INFO("TX complete %d", tx_complete_state);

}

static void ble_service_notify_state_event_handler(uint16_t conn_handle,
		ble_service_t *p_service, uint8_t p_event_notify_char, uint8_t p_event) {

	if (p_event_notify_char == BLE_AGGREGATOR_CHAR) {

		aggregator_notify_enable_state = p_event;
		stream_notify_enable_state = 0x00;

		NRF_LOG_INFO("Notify aggregator enable %d",
				aggregator_notify_enable_state);

	} else if (p_event_notify_char == BLE_STREAM_CHAR) {

		aggregator_notify_enable_state = 0x00;
		stream_notify_enable_state = p_event;

		NRF_LOG_INFO("Notify stream enable %d", stream_notify_enable_state);

	}

}

static void ble_service_write_handler(uint16_t conn_handle,
		ble_service_t *p_service, uint8_t event_type, uint8_t const *buffer,
		uint8_t buffer_size) {

	if (buffer_size == 5) {

		uint8_t control_number = buffer[0];

		if (command_id != control_number) {

			uint32_t collection_cycle = buffer[1] << 24;
			collection_cycle |= buffer[2] << 16;
			collection_cycle |= buffer[3] << 8;
			collection_cycle |= buffer[4];

			if (collection_cycle >= COLLECTION_CYCLE_TIMEOUT) {

				collection_cycle_timeout_count = 0;
				collection_cycle_timer_count = collection_cycle;

				command_id = control_number;

			}

		}

	}

}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void) {

	ret_code_t err_code;
	ble_service_init_t init = { 0 };
	nrf_ble_qwr_init_t qwr_init = { 0 };

	// Initialize Queued Write Module.
	qwr_init.error_handler = nrf_qwr_error_handler;

	err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
	APP_ERROR_CHECK(err_code);

	init.ble_service_tx_complete_handler = ble_service_tx_complete_handler;
	init.ble_service_notify_state_event_handler =
			ble_service_notify_state_event_handler;
	init.ble_write_handler = ble_service_write_handler;

	err_code = ble_service_init(&m_service, &init);
	APP_ERROR_CHECK(err_code);

}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module that
 *          are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply
 *       setting the disconnect_on_fail config parameter, but instead we use the event
 *       handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t *p_evt) {

	ret_code_t err_code;

	if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED) {

		err_code = sd_ble_gap_disconnect(m_conn_handle,
		BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);

		APP_ERROR_CHECK(err_code);

	}

}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error) {
	APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void) {

	ret_code_t err_code;
	ble_conn_params_init_t cp_init;

	memset(&cp_init, 0, sizeof(cp_init));

	cp_init.p_conn_params = NULL;
	cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
	cp_init.next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY;
	cp_init.max_conn_params_update_count = MAX_CONN_PARAMS_UPDATE_COUNT;
	cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
	cp_init.disconnect_on_fail = false;
	cp_init.evt_handler = on_conn_params_evt;
	cp_init.error_handler = conn_params_error_handler;

