AxDen-Dev/NRF52_Solar_Power_Asset_Tracker_example/main.c
	err_code = ble_conn_params_init(&cp_init);
	APP_ERROR_CHECK(err_code);

}

/**@brief Function for starting advertising.
 */
/**@brief Function for starting advertising.
 */
static void advertising_start(void) {

	ret_code_t err_code;

	err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
	APP_ERROR_CHECK(err_code);

}

static void adversting_stop(void) {

	sd_ble_gap_adv_stop(m_adv_handle);

}

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context) {
	ret_code_t err_code;

	switch (p_ble_evt->header.evt_id) {
	case BLE_GAP_EVT_CONNECTED:
		NRF_LOG_INFO("Connected")
		;

		tx_complete_state = 0x01;
		aggregator_notify_enable_state = 0x00;
		stream_notify_enable_state = 0x00;
		disconnect_timeout_count = 0;
		request_disconnect = 0x00;
		m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

		err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
		APP_ERROR_CHECK(err_code);

		break;

	case BLE_GAP_EVT_DISCONNECTED:
		NRF_LOG_INFO("Disconnected")
		;

		tx_complete_state = 0x01;
		aggregator_notify_enable_state = 0x00;
		stream_notify_enable_state = 0x00;
		disconnect_timeout_count = 0;
		request_disconnect = 0x00;
		m_conn_handle = BLE_CONN_HANDLE_INVALID;

		gap_params_init();

		advertising_init(data_update_state);

		advertising_start();

		break;

	case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
		// Pairing not supported
		err_code = sd_ble_gap_sec_params_reply(m_conn_handle,
		BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
		NRF_LOG_DEBUG("PHY update request.");
		ble_gap_phys_t const phys = { .rx_phys = BLE_GAP_PHY_AUTO, .tx_phys =
		BLE_GAP_PHY_AUTO, };
		err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle,
				&phys);
		APP_ERROR_CHECK(err_code);
	}
		break;

	case BLE_GATTS_EVT_SYS_ATTR_MISSING:
		// No system attributes have been stored.
		err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_GATTC_EVT_TIMEOUT:
		// Disconnect on GATT Client timeout event.
		NRF_LOG_DEBUG("GATT Client Timeout.")
		;
		err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
		BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_GATTS_EVT_TIMEOUT:
		// Disconnect on GATT Server timeout event.
		NRF_LOG_DEBUG("GATT Server Timeout.")
		;
		err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
		BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
		break;

	default:
		// No implementation needed.
		break;
	}
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void) {
	ret_code_t err_code;

	err_code = nrf_sdh_enable_request();
	APP_ERROR_CHECK(err_code);

	// Configure the BLE stack using the default settings.
	// Fetch the start address of the application RAM.
	uint32_t ram_start = 0;
	err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
	APP_ERROR_CHECK(err_code);

	// Enable BLE stack.
	err_code = nrf_sdh_ble_enable(&ram_start);
	APP_ERROR_CHECK(err_code);

	// Register a handler for BLE events.
	NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler,
			NULL);

#ifdef NRF528XX

	sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);

#endif

}

static void log_init(void) {
	ret_code_t err_code = NRF_LOG_INIT(NULL);
	APP_ERROR_CHECK(err_code);

	NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing power management.
 */
static void power_management_init(void) {
	ret_code_t err_code;
	err_code = nrf_pwr_mgmt_init();
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void) {
	if (NRF_LOG_PROCESS() == false) {
		nrf_pwr_mgmt_run();
	}
}

static void wait_200ms() {

	for (uint8_t i = 0; i < 2; i++) {

		while (!app_timer_update) {

			idle_state_handle();

		}

		app_timer_update = 0x00;

	}

}

static void init_error_led_indicating() {

	for (uint8_t i = 0; i < 10; i++) {

		nrf_gpio_pin_toggle(GPIO_LED_0);
		nrf_gpio_pin_toggle(GPIO_LED_1);

		wait_200ms();

	}

	nrf_gpio_pin_set(GPIO_LED_0);
	nrf_gpio_pin_set(GPIO_LED_1);

}

static void saadc_callback(nrf_drv_saadc_evt_t const *p_event) {

	if (p_event->type == NRF_DRV_SAADC_EVT_DONE) {

		ret_code_t err_code;

		err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer,
		SAADC_SAMPLES_IN_BUFFER);
		APP_ERROR_CHECK(err_code);

		int32_t adc_0_value = p_event->data.done.p_buffer[0];

		float battery = (float) adc_0_value / 255;
		battery = battery * 3.6;
		battery *= 3.0;
		battery_value = (uint8_t) (battery * 10);

		nrf_drv_saadc_uninit();

		NRF_SAADC->INTENCLR = (SAADC_INTENCLR_END_Clear
				<< SAADC_INTENCLR_END_Pos);
		NVIC_ClearPendingIRQ(SAADC_IRQn);

		m_saadc_initialized = 0x00;

		NRF_LOG_INFO("BAT %d", battery_value);
		NRF_LOG_FLUSH();

	}

}

static void saadc_init(void) {

	ret_code_t err_code;
	nrf_drv_saadc_config_t saadc_config;
	nrf_saadc_channel_config_t channel_config0;

	saadc_config.resolution = NRF_SAADC_RESOLUTION_8BIT;
	saadc_config.oversample = NRF_SAADC_OVERSAMPLE_DISABLED;
	saadc_config.interrupt_priority = APP_IRQ_PRIORITY_LOW;

	err_code = nrf_drv_saadc_init(&saadc_config, saadc_callback);
	APP_ERROR_CHECK(err_code);

	channel_config0.reference = NRF_SAADC_REFERENCE_INTERNAL;
	channel_config0.gain = NRF_SAADC_GAIN1_6;
	channel_config0.acq_time = NRF_SAADC_ACQTIME_10US;
	channel_config0.mode = NRF_SAADC_MODE_SINGLE_ENDED;
	channel_config0.pin_p = NRF_SAADC_INPUT_AIN3;
	channel_config0.pin_n = NRF_SAADC_INPUT_DISABLED;
	channel_config0.resistor_p = NRF_SAADC_RESISTOR_DISABLED;
	channel_config0.resistor_n = NRF_SAADC_RESISTOR_DISABLED;

	err_code = nrf_drv_saadc_channel_init(0, &channel_config0);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool_low_power[0],
	SAADC_SAMPLES_IN_BUFFER);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool_low_power[1],
	SAADC_SAMPLES_IN_BUFFER);
	APP_ERROR_CHECK(err_code);

