AxDen-Dev/NRF52_Solar_Power_Asset_Tracker_example/main.c
}

static void read_battery_level(void) {

	if (!m_saadc_initialized) {

		saadc_init();

	}

	m_saadc_initialized = 0x01;

	nrf_drv_saadc_sample();

	while (m_saadc_initialized) {

		idle_state_handle();

	}

	nrf_gpio_pin_clear(GPIO_BAT_EN);

}

static uint8_t i2c_write8(uint8_t address, uint8_t reg) {

	uint16_t timeout = UINT16_MAX;
	uint8_t txBuffer = reg;

	twi_write_done = 0x00;
	twi_read_done = 0x00;
	twi_address_nack = 0x00;

	ret_code_t result = nrf_drv_twi_tx(&m_twi, address, &txBuffer, 1, true);

	if (result == NRF_SUCCESS) {

		while (!twi_write_done && --timeout) {

		}

		if (!timeout || twi_address_nack) {

			return 0x00;

		} else {

			return 0x01;

		}

	} else {

		return 0x00;

	}

}

static uint8_t i2c_write16(uint8_t address, uint8_t reg, uint8_t value) {

	uint16_t timeout = UINT16_MAX;
	uint8_t txBuffer[2] = { 0x00 };
	txBuffer[0] = reg;
	txBuffer[1] = value;

	twi_write_done = 0x00;
	twi_read_done = 0x00;
	twi_address_nack = 0x00;

	ret_code_t result = nrf_drv_twi_tx(&m_twi, address, txBuffer, 2, false);

	if (result == NRF_SUCCESS) {

		while (!twi_write_done && --timeout) {

		}

		if (!timeout || twi_address_nack) {

			return 0x00;

		} else {

			return 0x01;

		}

	} else {

		return 0x00;

	}

}

static uint8_t i2c_read_buffer(uint8_t address, uint8_t *read_value,
		const uint8_t buffer_size) {

	uint16_t timeout = UINT16_MAX;
	uint8_t rxBuffer[buffer_size];

	twi_write_done = 0x00;
	twi_read_done = 0x00;
	twi_address_nack = 0x00;

	ret_code_t result = nrf_drv_twi_rx(&m_twi, address, rxBuffer, buffer_size);

	if (result == NRF_SUCCESS) {

		while (!twi_read_done && --timeout) {

		}

		memcpy(read_value, rxBuffer, buffer_size);

		if (!timeout || twi_address_nack) {

			return 0x00;

		} else {

			return 0x01;

		}

	} else {

		return 0x00;

	}

}

static uint8_t init_bma400() {

	uint8_t i2c_state = i2c_write16( BMA400_ADDRESS, 0x7E, 0xB6);

	wait_200ms();

	i2c_state = i2c_state & i2c_write16(BMA400_ADDRESS, 0x1A, 0b00000101);

	i2c_state = i2c_state & i2c_write16( BMA400_ADDRESS, 0x19, 0b00000010);

	return i2c_state;

}

static uint8_t bma400_acceleration_read(int16_t *ax, int16_t *ay, int16_t *az) {

	uint8_t i2c_state = 0x01;

	uint8_t rx_buffer[6] = { 0x00 };

	i2c_state = i2c_state & i2c_write8(BMA400_ADDRESS, 0x04);

	i2c_state = i2c_state
			& i2c_read_buffer(BMA400_ADDRESS, rx_buffer, sizeof(rx_buffer));

	int16_t accel = (rx_buffer[1] << 8) | rx_buffer[0];

	if (accel > 2047) {

		accel -= 4096;

	}

	*ax = (int16_t) (accel * BMA400_SCALE);

	accel = (rx_buffer[3] << 8) | rx_buffer[2];

	if (accel > 2047) {

		accel -= 4096;

	}

	*ay = (int16_t) (accel * BMA400_SCALE);

	accel = (rx_buffer[5] << 8) | rx_buffer[4];

	if (accel > 2047) {

		accel -= 4096;

	}

	*az = (int16_t) (accel * BMA400_SCALE);

	NRF_LOG_INFO("BMA400 %d %d %D", *ax, *ay, *az);
	NRF_LOG_FLUSH();

	return i2c_state;

}

static void twi_scan(void) {

	NRF_LOG_INFO("I2C Scan started.");

	for (uint16_t i = 0; i < 127; i++) {

		uint8_t reg = 0x01;
		uint8_t twi_timeout = 5;

		twi_write_done = 0x00;
		twi_read_done = 0x00;
		twi_address_nack = 0x00;

		nrf_drv_twi_tx(&m_twi, i, &reg, 1, false);

		while (!twi_write_done && --twi_timeout) {

			idle_state_handle();

		}

		if (!twi_address_nack) {

			NRF_LOG_INFO("FIND %02X", i);
			NRF_LOG_FLUSH();

		}

	}

}

static void twi_handler(nrf_drv_twi_evt_t const *p_event, void *p_context) {

	switch (p_event->type) {

	case NRF_DRV_TWI_EVT_DONE:

		twi_write_done = 0x01;
		twi_read_done = 0x01;

		break;

	default:
//	    NRF_DRV_TWI_EVT_ADDRESS_NACK,
//	    NRF_DRV_TWI_EVT_DATA_NACK

		twi_write_done = 0x01;
		twi_read_done = 0x01;
		twi_address_nack = 0x01;

		break;

	}

}

static void twi_init(void) {

	ret_code_t err_code;

	const nrf_drv_twi_config_t twi_config =
			{ .scl = I2C_SCL_GPIO, .sda = I2C_SDA_GPIO, .frequency =
					NRF_DRV_TWI_FREQ_400K, .interrupt_priority =
					APP_IRQ_PRIORITY_HIGH, .clear_bus_init = false };

	err_code = nrf_drv_twi_init(&m_twi, &twi_config, twi_handler, NULL);
	APP_ERROR_CHECK(err_code);

	nrf_drv_twi_enable(&m_twi);

}

void celluar_callback_bg96(bg96_data_t data) {

	bg96_data = data;

}

void celluar_callback_sara_u2(sara_u2_data_t data) {

	sara_u2_data = data;

}

void gps_callback_quectel(quectel_gps_data_t data) {

	quectel_gps_data = data;

}

void gps_callback_ublox(ublox_gps_data_t data) {

	ublox_gps_data = data;

}

static void uart_event_handle(app_uart_evt_t *p_event) {

	static uint8_t uart_data;

	switch (p_event->evt_type) {

	case APP_UART_DATA_READY: {
		UNUSED_VARIABLE(app_uart_get(&uart_data));

		if (uart_type == 0x01) {
			//Cellar

#ifdef BG96

			bg96_uart_input(uart_data);

#endif

#ifdef SARA_U2

			sara_u2_uart_input(uart_data);

#endif

		} else if (uart_type == 0x02) {
			//GPS

#ifdef QUECTEL_GPS

			quectel_gps_nmea_input(uart_data);

#endif

#ifdef UBLOX_GPS

			ublox_gps_ubx_input(uart_data);

#endif

		}

	}

		break;

	case APP_UART_DATA: {
		uint8_t data;
		UNUSED_VARIABLE(app_uart_get(&data));

		break;

	}

	case APP_UART_COMMUNICATION_ERROR: {
		NRF_LOG_ERROR("COMM ERROR");

	}
		break;

	case APP_UART_FIFO_ERROR: {
		NRF_LOG_ERROR("FIFO ERROR");

	}
		break;

	default:
		break;
	}

}

static void init_uart_1() {

	uint32_t err_code;

	const app_uart_comm_params_t comm_params = { .rx_pin_no = UART_1_TX_GPIO,
			.tx_pin_no = UART_1_RX_GPIO, UART_PIN_DISCONNECTED,
			UART_PIN_DISCONNECTED, .flow_control =
					APP_UART_FLOW_CONTROL_DISABLED, .use_parity = false,
			UART_BAUDRATE_BAUDRATE_Baud115200 };

	APP_UART_FIFO_INIT(&comm_params, 256, 256, uart_event_handle,
			APP_IRQ_PRIORITY_LOWEST, err_code);

	APP_ERROR_CHECK(err_code);

