AxDen-Dev/NRF52_Solar_Power_Asset_Tracker_example/main.c
}

static void init_uart_2() {

	uint32_t err_code;

	const app_uart_comm_params_t comm_params = { .rx_pin_no = UART_2_RX_GPIO,
			.tx_pin_no = UART_2_TX_GPIO, UART_PIN_DISCONNECTED,
			UART_PIN_DISCONNECTED, .flow_control =
					APP_UART_FLOW_CONTROL_DISABLED, .use_parity = false,
			UART_BAUDRATE_BAUDRATE_Baud9600 };

	APP_UART_FIFO_INIT(&comm_params, 256, 256, uart_event_handle,
			APP_IRQ_PRIORITY_LOWEST, err_code);

	APP_ERROR_CHECK(err_code);

}

static void uart_uninit() {

	uint32_t err_code;
	err_code = app_uart_close();

	APP_ERROR_CHECK(err_code);

}

static uint8_t init_GPS() {

	uint8_t gps_state = 0x00;

	init_uart_2();

	uart_type = 0x02;

#ifdef QUECTEL_GPS

	set_quectel_gps_gpio_instance(GPIO_GPS_EN);

	set_quectel_gps_callback(gps_callback_quectel);

	if (set_quectel_gps_power_on(10)) {

		set_quectel_gps_nmea_off_gga_only(10);

		set_quectel_gps_sbas_disable(10);

		gps_state = 0x01;

		NRF_LOG_INFO("GPS init success");
		NRF_LOG_FLUSH();

	} else {

		NRF_LOG_INFO("GPS init error");
		NRF_LOG_FLUSH();

	}

	set_quectel_gps_power_off();

#endif

#ifdef UBLOX_GPS

	set_ublox_gps_gpio_instance(GPIO_GPS_EN);

	set_ublox_callback(gps_callback_ublox);

	set_ublox_gps_power_on();

	set_ublox_uart_nmea_off();

	set_ublox_uart_pvt_enable();

	set_ublox_gps_power_off();

#endif

	uart_type = 0x00;

	uart_uninit();

	return gps_state;

}

static uint8_t update_GPS() {

	uint8_t gps_state = 0x00;

	init_uart_2();

	uart_type = 0x02;

#ifdef QUECTEL_GPS

	set_quectel_gps_gpio_instance(GPIO_GPS_EN);

	set_quectel_gps_callback(gps_callback_quectel);

	if (set_quectel_gps_power_on(10)) {

		set_quectel_gps_nmea_off_gga_only(10);

		set_quectel_gps_sbas_disable(10);

		NRF_LOG_INFO("GPS init success, start GPS");
		NRF_LOG_FLUSH();

		for (uint16_t i = 0; i < GPS_UPDATE_TIME; i++) {

			HDOP = quectel_gps_data.HDOP;
			latitude = quectel_gps_data.latitude;
			longitude = quectel_gps_data.longitude;

			if (quectel_gps_data.navigation_statue > 0
					&& quectel_gps_data.HDOP < 40) {

				break;

			}

			while (!one_sec_timer_update) {

				idle_state_handle();

			}

			one_sec_timer_update = 0x00;

		}

		gps_state = 0x01;

	} else {

		NRF_LOG_INFO("GPS init error");
		NRF_LOG_FLUSH();

	}

	set_quectel_gps_power_off();

#endif

	uart_type = 0x00;

	uart_uninit();

	return gps_state;

}

static uint8_t init_celluar() {

	uint8_t celluar_state = 0x00;

	init_uart_1();

	uart_type = 0x01;

#ifdef BG96

	set_bg96_gpio_instance(GPIO_CELLUAR_EN, GPIO_CELLUAR_PWR);

	set_bg96_callback(celluar_callback_bg96);

	if (set_bg96_power_on(3, 10)) {

		if (bg96_init_config_setup()) {

			if (bg96_init_network_setup()) {

				build_event_packet(0x01, EVENT_TYPE_POWER_ON);

				if (bg96_tcp_data_upload(node_packet_data.buffer,
						node_packet_data_size)) {

					tcp_socket_buffer_size = 0;
					memset(tcp_socket_buffer, 0x00, sizeof(tcp_socket_buffer));

					tcp_socket_buffer_size =
							get_bg96_socket_recevice_buffer_data(
									tcp_socket_buffer);

					packet_header_0_t downlink_packet_header_0;
					downlink_packet_header_0.value = tcp_socket_buffer[0];

					if (downlink_packet_header_0.bits.PACKET_TYPE
							== PACKET_TYPE_DOWNLINK_TIME_DATA_HEADER_0) {

						time_stamp = tcp_socket_buffer[2] << 24;
						time_stamp |= tcp_socket_buffer[3] << 16;
						time_stamp |= tcp_socket_buffer[4] << 8;
						time_stamp |= tcp_socket_buffer[5];

						time_stamp_init = 0x01;

						celluar_state = 0x01;

					}
				}

			}

		}

	}

	set_bg96_power_off(1, 10);

#endif

#ifdef SARA_U2

	set_sara_u2_gpio_instance(GPIO_CELLUAR_EN, GPIO_CELLUAR_PWR);

	set_sara_callback(celluar_callback_sara_u2);

	if (set_sara_power_on(3, 10)) {

		if (sara_u2_init_config_setup()) {

			if (sara_u2_init_network_setup()) {

				celluar_state = 0x01;

			}

		}

	}

	set_sara_power_off(1, 10);

	if (!error) {

		initErrorUpdate();

	}

#endif

	if (!celluar_state) {

		NRF_LOG_INFO("celluar init error");
		NRF_LOG_FLUSH();

		init_error_led_indicating();

	} else {

		NRF_LOG_INFO("celluar init success");
		NRF_LOG_FLUSH();

	}

	uart_type = 0x00;

	uart_uninit();

	return celluar_state;

}

static void update_setup_command() {

	if (tcp_socket_buffer_size == 5) {

		uint8_t control_number = tcp_socket_buffer[0];

		if (command_id != control_number) {

			uint32_t collection_cycle = tcp_socket_buffer[1] << 24;
			collection_cycle |= tcp_socket_buffer[2] << 16;
			collection_cycle |= tcp_socket_buffer[3] << 8;
			collection_cycle |= tcp_socket_buffer[4];

			if (collection_cycle >= COLLECTION_CYCLE_TIMEOUT) {

				collection_cycle_timeout_count = 0;
				collection_cycle_timer_count = collection_cycle;

				command_id = control_number;

			}

		}

	}

}

static void update_celluar() {

	init_uart_1();

	uart_type = 0x01;

#ifdef BG96

	if (set_bg96_power_on(3, 10)) {

		if (bg96_init_config_setup()) {

			if (bg96_init_network_setup()) {

				if (bg96_tcp_data_upload(node_packet_data.buffer,
						node_packet_data_size)) {

					tcp_socket_buffer_size = 0;
					memset(tcp_socket_buffer, 0x00, sizeof(tcp_socket_buffer));

					tcp_socket_buffer_size =
							get_bg96_socket_recevice_buffer_data(
									tcp_socket_buffer);

					update_setup_command();

				}

			}

		}

	}

	set_bg96_power_off(1, 10);

#endif

#ifdef SARA_U2

	if (set_sara_power_on(3, 10)) {

		if (sara_u2_init_config_setup()) {

			if (sara_u2_init_network_setup()) {

				if (sara_u2_tcp_data_upload(radio_packet_payload.buffer,
						sizeof(radio_packet_payload.buffer))) {

					tcp_socket_read_buffer_size = 0;
					memset(tcp_socket_read_buffer, 0x00,
							sizeof(tcp_socket_read_buffer));

					tcp_socket_read_buffer_size =
							get_sarau2_socket_recevice_buffer_datat(
									tcp_socket_read_buffer);

