AxDen-Dev/NRF52_Solar_Power_Asset_Tracker_example/main.c
				}

			}

		}

	}

	set_sara_power_off(1, 10);

#endif

	uart_type = 0x00;

	uart_uninit();

}

#ifdef NRF528XX_FEM

void fem_init(void) {

	ret_code_t err_code;
	ble_opt_t opt;
	uint32_t gpiote_ch;
	nrf_ppi_channel_t ppi_set_ch;
	nrf_ppi_channel_t ppi_clr_ch;
	nrf_drv_gpiote_out_config_t config = GPIOTE_CONFIG_OUT_TASK_TOGGLE(false);

	nrf_gpio_cfg_output(FEM_ANT_SEL);
	nrf_gpio_pin_clear(FEM_ANT_SEL);

	nrf_gpio_cfg_output(FEM_CSD);
	nrf_gpio_pin_set(FEM_CSD);

	nrf_gpio_cfg_output(FEM_CHL);
	nrf_gpio_pin_set(FEM_CHL);

	nrf_gpio_cfg_output(FEM_CPS);

	nrf_gpio_pin_clear(FEM_CPS);

	nrf_gpio_cfg_output(FEM_CTX);
	nrf_gpio_pin_clear(FEM_CTX);

	nrf_gpio_cfg_output(FEM_CRX);
	nrf_gpio_pin_clear(FEM_CRX);

	err_code = nrf_drv_gpiote_init();

	if (err_code != NRF_ERROR_INVALID_STATE) {

		APP_ERROR_CHECK(err_code);

	}

	err_code = nrf_drv_ppi_init();

	if (err_code != NRF_ERROR_INVALID_STATE) {

		APP_ERROR_CHECK(err_code);

	}

	err_code = nrf_drv_ppi_channel_alloc(&ppi_set_ch);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_drv_ppi_channel_alloc(&ppi_clr_ch);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_drv_gpiote_out_init(FEM_CRX, &config);
	APP_ERROR_CHECK(err_code);

	gpiote_ch = nrf_drv_gpiote_out_task_addr_get(FEM_CRX);

	memset(&opt, 0, sizeof(ble_opt_t));
	opt.common_opt.pa_lna.gpiote_ch_id = (gpiote_ch - NRF_GPIOTE_BASE) >> 2; // GPIOTE channel used for radio pin toggling
	opt.common_opt.pa_lna.ppi_ch_id_clr = ppi_clr_ch; // PPI channel used for radio pin clearing
	opt.common_opt.pa_lna.ppi_ch_id_set = ppi_set_ch; // PPI channel used for radio pin setting

	opt.common_opt.pa_lna.pa_cfg.active_high = 1; // Set the pin to be active high
	opt.common_opt.pa_lna.pa_cfg.enable = 1;              // Enable toggling
	opt.common_opt.pa_lna.pa_cfg.gpio_pin = FEM_CTX; // The GPIO pin to toggle

	opt.common_opt.pa_lna.lna_cfg.active_high = 1; // Set the pin to be active high
	opt.common_opt.pa_lna.lna_cfg.enable = 1;             // Enable toggling
	opt.common_opt.pa_lna.lna_cfg.gpio_pin = FEM_CRX; // The GPIO pin to toggle

	err_code = sd_ble_opt_set(BLE_COMMON_OPT_PA_LNA, &opt);
	APP_ERROR_CHECK(err_code);

}

#endif

static void gpio_init() {

	nrf_gpio_cfg_output(GPIO_LED_0);
	nrf_gpio_pin_set(GPIO_LED_0);

	nrf_gpio_cfg_output(GPIO_LED_1);
	nrf_gpio_pin_set(GPIO_LED_1);

	nrf_gpio_cfg_output(GPIO_BAT_EN);
	nrf_gpio_pin_clear(GPIO_BAT_EN);

	nrf_gpio_cfg_output(GPIO_CELLUAR_EN);
	nrf_gpio_pin_clear(GPIO_CELLUAR_EN);

	nrf_gpio_cfg_output(GPIO_CELLUAR_PWR);
	nrf_gpio_pin_clear(GPIO_CELLUAR_PWR);

	nrf_gpio_cfg_output(GPIO_GPS_EN);
	nrf_gpio_pin_clear(GPIO_GPS_EN);

	nrf_gpio_cfg_input(GPIO_BTN, NRF_GPIO_PIN_NOPULL);

}

static void build_event_packet(uint8_t device_role, uint8_t event_type) {

//	uint8_t header_0;
//	uint8_t header_1;
//	uint8_t mac_address[8];
//	uint8_t product_id[2];
//	uint8_t event_value_0;
//	uint8_t event_value_1;

	packet_header_0.bits.DEVICE_ROLE = device_role;
	packet_header_0.bits.PACKET_TYPE = PACKET_TYPE_UPLINK_EVENT_HEADER_0;

	node_packet_data.Event_Packet.header_0 = packet_header_0.value;
	node_packet_data.Event_Packet.header_1 = packet_header_1.value;

	memcpy(node_packet_data.Event_Packet.mac_address, mac_address,
			sizeof(mac_address));

	node_packet_data.Event_Packet.product_id[0] = product_id.value >> 8;
	node_packet_data.Event_Packet.product_id[1] = product_id.value;

	packet_event_0.bits.EVENT_TYPE = event_type;
	node_packet_data.Event_Packet.event_value_0 = packet_event_0.value;
	node_packet_data.Event_Packet.event_value_1 = packet_event_1.value;

	node_packet_data_size = NODE_EVENT_PACKET_SIZE;

	NRF_LOG_INFO("build_event_packet");

}

static void build_sensor_data_packet(uint8_t device_role) {

//	uint8_t header_0;
//	uint8_t header_1;
//	uint8_t mac_address[8];
//	uint8_t packet_info; //11Byte
//	uint8_t battery_value;
//	uint8_t temperature[2];
//	uint8_t ax[2];
//	uint8_t ay[2];
//	uint8_t az[2];
//	uint8_t HDOP;
//	uint8_t latitude[4];
//	uint8_t longitude[4];

	packet_header_0.bits.DEVICE_ROLE = device_role;
	packet_header_0.bits.PACKET_TYPE = PACKET_TYPE_UPLINK_SENSOR_DATA_HEADER_0;

	node_packet_data.Data_Packet.header_0 = packet_header_0.value;
	node_packet_data.Data_Packet.header_1 = packet_header_1.value;

	memcpy(node_packet_data.Data_Packet.mac_address, mac_address,
			sizeof(mac_address));

	node_packet_data.Data_Packet.packet_info = (command_id << 4) & 0xF0;
	node_packet_data.Data_Packet.packet_info |= (packet_id & 0x0F);

	node_packet_data.Data_Packet.battery_value = battery_value;

	node_packet_data.Data_Packet.temperature[0] = temperature >> 8;
	node_packet_data.Data_Packet.temperature[1] = temperature;

	node_packet_data.Data_Packet.intterupt = intterupt;

	node_packet_data.Data_Packet.ax[0] = ax >> 8;
	node_packet_data.Data_Packet.ax[1] = ax;

	node_packet_data.Data_Packet.ay[0] = ay >> 8;
	node_packet_data.Data_Packet.ay[1] = ay;

	node_packet_data.Data_Packet.az[0] = az >> 8;
	node_packet_data.Data_Packet.az[1] = az;

	node_packet_data.Data_Packet.roll[0] = roll >> 8;
	node_packet_data.Data_Packet.roll[1] = roll;

	node_packet_data.Data_Packet.pitch[0] = pitch >> 8;
	node_packet_data.Data_Packet.pitch[1] = pitch;

	node_packet_data_size = NODE_DATA_PACKET_SIZE;

	NRF_LOG_INFO("build_sensor_data_packet");

}

/**@brief Function for application main entry.
 */
int main(void) {

	uint8_t event_init = 0x00;
	uint8_t event_type = EVENT_TYPE_POWER_ON;

	uint8_t event_packet_ready = 0x00;
	uint8_t sensor_data_packet_ready = 0x00;

	uint8_t battery_read_step = 0x00;

	uint8_t on_off_state = 0x01;
	uint8_t on_off_count = 0;

	uint32_t device_id_0 = NRF_FICR->DEVICEID[1];
	uint32_t device_id_1 = NRF_FICR->DEVICEID[0];

	mac_address[0] = device_id_0 >> 24;
	mac_address[1] = device_id_0 >> 16;
	mac_address[2] = device_id_0 >> 8;
	mac_address[3] = device_id_0;

	mac_address[4] = device_id_1 >> 24;
	mac_address[5] = device_id_1 >> 16;
	mac_address[6] = device_id_1 >> 8;
	mac_address[7] = device_id_1;

	log_init();

