AxDen-Dev/NRF52_Solar_Power_Asset_Tracker_example/main.c
	timers_init();

	gpio_init();

	twi_init();

	power_management_init();

	ble_stack_init();

#ifdef NRF528XX_FEM

	fem_init();

#endif

	gap_params_init();

	gatt_init();

	services_init();

	advertising_init(data_update_state);

	conn_params_init();

	app_timer_start(m_app_timer_id, APP_TIMER_DELAY, NULL);

	/////////////////////// Init Protocol Data /////////////////////

	packet_header_0.value = 0x00;
	packet_header_0.bits.DEVICE_ROLE = 0x01;
	packet_header_0.bits.PACKET_TYPE = PACKET_TYPE_UPLINK_EVENT_HEADER_0;
	packet_header_0.bits.CHIP_MANUFACTURER = CHIP_MANUFACTURER_NORDIC;

	packet_header_1.value = 0x00;
	packet_header_1.bits.CHIP_IDENTIFIER = CHIP_IDENTIFIER_NRF52832;
	packet_header_1.bits.COMMUNICATION_TYPE =
	COMMUNICATION_TYPE_BLE_CONNECTION_1M;

	product_id.value = 0x00;
	product_id.bits.PRODUCT_ID = PRODUCT_ID_AA_MB_01;
	product_id.bits.DEVICE_TYPE = 0x00;
	product_id.bits.PRODUCT_TYPE = 0x01;

	packet_event_0.value = 0x00;
	packet_event_0.bits.EVENT_TYPE = EVENT_TYPE_POWER_ON;

	packet_event_1.value = 0x00;

	//////////////////// Start Application ///////////////////

	wait_200ms();

	twi_scan();

	if (!init_bma400()) {

		packet_event_1.bits.BMA400_ERROR = 0x01;

	}

	set_si7051_i2c_instance(m_twi);

	if (!init_si7051()) {

		packet_event_1.bits.SI7051_ERROR = 0x01;

	}

	nrf_gpio_pin_set(GPIO_BAT_EN);

	wait_200ms();

	read_battery_level();

	if (!init_GPS()) {

		packet_event_1.bits.GPS_ERROR = 0x01;

	}

	if (!init_celluar()) {

		packet_event_1.bits.CELLUAR_ERROR = 0x01;

	}

	init_state = 0x01;

	//////////////////// Start Main Loop ///////////////////

	event_packet_ready = 0x01;
	data_update_state = 0x01;
	advertising_init(data_update_state);

	advertising_start();

	NRF_LOG_INFO("Start main loop");

	for (;;) {

		if (one_sec_timer_update) {

			if (!nrf_gpio_pin_read(GPIO_BTN)) {

				on_off_count += 1;

				if (on_off_count >= 3) {

					if (on_off_state) {

						event_type = EVENT_TYPE_POWER_OFF;

						NRF_LOG_INFO("EVENT_TYPE_POWER_OFF");

					} else {

						event_type = EVENT_TYPE_POWER_ON;

						NRF_LOG_INFO("EVENT_TYPE_POWER_ON");

					}

					event_init = 0x00;
					event_packet_ready = 0x01;
					data_update_state = 0x01;

					if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {

						adversting_stop();
						gap_params_init();
						advertising_init(data_update_state);
						advertising_start();

					} else {

						sd_ble_gap_disconnect(m_conn_handle,
						BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

					}

					on_off_state = !on_off_state;
					on_off_count = 0;

					NRF_LOG_INFO("on_off_state %d", on_off_state);

				}

				nrf_gpio_pin_clear(GPIO_LED_0);

			} else {

				on_off_count = 0;

				nrf_gpio_pin_set(GPIO_LED_0);

			}

			one_sec_timer_update = 0x00;

		}

		if (collection_gps_update) {

			packet_event_1.bits.GPS_ERROR = 0x00;

			if (!update_GPS()) {

				packet_event_1.bits.GPS_ERROR = 0x01;

			}

			collection_gps_update = 0x00;

		}

		if (on_off_state && event_init) {

			packet_event_1.bits.BMA400_ERROR = 0x00;

			if (!bma400_acceleration_read(&ax_buffer, &ay_buffer, &az_buffer)) {

				packet_event_1.bits.BMA400_ERROR = 0x01;

			} else {

				uint32_t vector = powf(ax_buffer, 2);
				vector += powf(ay_buffer, 2);
				vector += powf(az_buffer, 2);
				vector = sqrtf(vector);

				if (vector > 1500) {

					intterupt_buffer += 1;

				}

				if (vector > 800 && vector < 1200) {

					roll_buffer =
							180
									* atanf(
											ay_buffer
													/ sqrtf(
															ax_buffer
																	* ax_buffer
																	+ az_buffer
																			* az_buffer)) / M_PI;
					pitch_buffer =
							180
									* atanf(
											ax_buffer
													/ sqrtf(
															ay_buffer
																	* ay_buffer
																	+ az_buffer
																			* az_buffer)) / M_PI;

				}

			}

			if (collection_cycle_update) {

				if (battery_read_step == 0x00) {

					nrf_gpio_pin_set(GPIO_BAT_EN);

					battery_read_step = 0x01;

				} else {

					read_battery_level();

					packet_event_1.bits.SI7051_ERROR = 0x00;

					if (!get_si7051_temperature(&temperature)) {

						packet_event_1.bits.SI7051_ERROR = 0x01;

					}

					intterupt = intterupt_buffer;

					ax = ax_buffer;
					ay = ay_buffer;
					az = az_buffer;

					roll = roll_buffer;
					pitch = pitch_buffer;

					packet_id += 1;

					if (packet_id > 0x0F) {

						packet_id = 0;

					}

					update_celluar();

					sensor_data_packet_ready = 0x01;

					battery_read_step = 0x00;

					intterupt_buffer = 0;

					collection_cycle_update = 0x00;

					data_update_state = 0x01;

					if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {

						adversting_stop();

						gap_params_init();

						advertising_init(data_update_state);

						advertising_start();

					}

				}

			}

		}

		if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {

			if (aggregator_notify_enable_state || stream_notify_enable_state) {

				if (event_packet_ready || sensor_data_packet_ready) {

					if (tx_complete_state == 0x01) {

						tx_complete_state = 0x00;

						if (event_packet_ready == 0x01) {

							build_event_packet(0x00, event_type);

						} else if (sensor_data_packet_ready == 0x01) {

							build_sensor_data_packet(0x00);

						}

						if (aggregator_notify_enable_state) {

							ble_service_send_aggregator_notification(
									m_conn_handle, &m_service,
									node_packet_data.buffer,
									node_packet_data_size);

							NRF_LOG_INFO("Gateway notify send");

						} else if (stream_notify_enable_state) {

							ble_service_send_stream_notification(m_conn_handle,
									&m_service, node_packet_data.buffer,
									node_packet_data_size);

							NRF_LOG_INFO("Stream notify send");

						}

					} else if (tx_complete_state == 0x02) {

						if (event_packet_ready == 0x01) {

							event_packet_ready = 0x00;

						} else if (sensor_data_packet_ready == 0x01) {

							sensor_data_packet_ready = 0x00;

						}

						if (!event_packet_ready && !sensor_data_packet_ready) {

							data_update_state = 0x00;
							disconnect_timeout_count = DISCONNECT_TIMEOUT;

						} else {

							tx_complete_state = 0x01;

						}

						event_init = 0x01;

					}

				}

				if (stream_notify_enable_state) {

					disconnect_timeout_count = 0;

				}

			}

			disconnect_timeout_count++;

			if (disconnect_timeout_count > DISCONNECT_TIMEOUT) {

				if (request_disconnect == 0x00) {

					sd_ble_gap_disconnect(m_conn_handle,
					BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

					request_disconnect = 0x01;

					NRF_LOG_INFO("Disconnect request");

				}

			}

		} else {

			disconnect_timeout_count = 0;

		}

		while (!app_timer_update) {

			idle_state_handle();

		}

		app_timer_update = 0x00;

		NRF_LOG_FLUSH();

	}
}

/**
 * @}
 */
